#+title: Learn2

#+PROPERTY: header-args:python :session learn1 :async

#+begin_src python
import pandas as pd
import openml
#+end_src

#+RESULTS:
: None

#+begin_src python
DATASET_ID = 1590

openml.datasets.list_datasets(output_format="dataframe")
dataset = openml.datasets.get_dataset(DATASET_ID)
adult_census, _, _, _ = dataset.get_data(dataset_format="dataframe")
adult_census.dtypes
#+end_src

#+RESULTS:
#+begin_example
age                  uint8
workclass         category
fnlwgt             float64
education         category
education-num        uint8
marital-status    category
occupation        category
relationship      category
race              category
sex               category
capital-gain       float64
capital-loss       float64
hours-per-week       uint8
native-country    category
class             category
dtype: object
#+end_example

#+begin_src python
adult_census = adult_census[['age', 'capital-gain', 'capital-loss', 'hours-per-week', 'class']]
adult_census
#+end_src

#+RESULTS:
#+begin_example
       age  capital-gain  capital-loss  hours-per-week  class
0       25           0.0           0.0              40  <=50K
1       38           0.0           0.0              50  <=50K
2       28           0.0           0.0              40   >50K
3       44        7688.0           0.0              40   >50K
4       18           0.0           0.0              30  <=50K
...    ...           ...           ...             ...    ...
48837   27           0.0           0.0              38  <=50K
48838   40           0.0           0.0              40   >50K
48839   58           0.0           0.0              40  <=50K
48840   22           0.0           0.0              20  <=50K
48841   52       15024.0           0.0              40   >50K

[48842 rows x 5 columns]
#+end_example

#+begin_src python
target_name = "class"
target = adult_census[target_name]
target
#+end_src

#+RESULTS:
#+begin_example
0        <=50K
1        <=50K
2         >50K
3         >50K
4        <=50K
         ...
48837    <=50K
48838     >50K
48839    <=50K
48840    <=50K
48841     >50K
Name: class, Length: 48842, dtype: category
Categories (2, str): ['>50K' < '<=50K']
#+end_example

#+begin_src python
data = adult_census.drop(columns=[target_name])
data
#+end_src

#+RESULTS:
#+begin_example
       age  capital-gain  capital-loss  hours-per-week
0       25           0.0           0.0              40
1       38           0.0           0.0              50
2       28           0.0           0.0              40
3       44        7688.0           0.0              40
4       18           0.0           0.0              30
...    ...           ...           ...             ...
48837   27           0.0           0.0              38
48838   40           0.0           0.0              40
48839   58           0.0           0.0              40
48840   22           0.0           0.0              20
48841   52       15024.0           0.0              40

[48842 rows x 4 columns]
#+end_example

#+begin_src python
data.columns
#+end_src

#+RESULTS:
: Index(['age', 'capital-gain', 'capital-loss', 'hours-per-week'], dtype='str')

#+begin_src python
from sklearn.neighbors import KNeighborsClassifier
model = KNeighborsClassifier()
_ = model.fit(data, target)
#+end_src

#+RESULTS:
: None

#+begin_src python
target_predicted = model.predict(data)
target_predicted[:5]
#+end_src

#+RESULTS:
: array(['<=50K', '<=50K', '<=50K', '>50K', '<=50K'], dtype=object)

#+begin_src python
target[:5] == target_predicted[:5]
#+end_src

#+RESULTS:
: 0     True
: 1     True
: 2    False
: 3     True
: 4     True
: Name: class, dtype: bool

#+begin_src python
(target == target_predicted).mean()
#+end_src

#+RESULTS:
: 0.8175340895131239

#+begin_src python
import numpy as np
count = data.shape[0]
n_train = int(count * 0.7)

X_train = data[:n_train]
y_train = target[:n_train]

X_test = data[n_train:]
y_test = target[n_train:]
#+end_src

#+RESULTS:
: None

#+begin_src python
model = KNeighborsClassifier()
_ = model.fit(X_train, y_train)

accuracy = model.score(X_test, y_test)
accuracy
#+end_src

#+RESULTS:
: 0.8018153279191974

#+begin_src python
model_name = model.__class__.__name__

f"The test accuracy using a {model_name} is {accuracy:.3f}"
#+end_src

#+RESULTS:
: The test accuracy using a KNeighborsClassifier is 0.802
